
// Методы и свойства строк и чисел
const string = 'Пример какой-то строки';
string.toUpperCase()            // вернуть строку с большими буквами
string.toLowerCase()            // вернуть строку с маленькими буквами
string.indexOf('какой')         // [7]: поиск подстроки, если подстрока не найдена - возвращает [-1]
string.slice(7, 15)             // ['какой-то']: вырезает часть строки по индексу, последний индекс НЕ ВКЛЮЧИТЕЛЬНО.
                                // если второй аргумент не указан - вырезается часть до конца строки.
                                // если указать отрицательное значение, отсчет ведется с конца строки
string.substring(7,15)          // ['какой-то']: почти как slice, не поддерживает отрицательные значения
string.substr(7,7)  // ['какой-то']: вырезает часть строки по индексу и длине

const number = 12.2;
Math.round(number)              //[12]: округление числа до ближайшего целого

const test = '12.2px';
parseInt(test)                  // [12]: перевод строки в целое число
parseFloat(test)                  // [12]: перевод строки в число с плавающей точкой


console.log(parseFloat(test))